{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Livemint.com"},"author":"IANS","title":"NASA steps in to help develop COVID-19 solutions - Livemint","description":"One of their first efforts was to build a prototype oxygen hood that has now proven to work for the doctors at the hospital, NASA said","url":"https://www.livemint.com/news/world/nasa-steps-in-to-help-develop-covid-19-solutions-11587196762979.html","urlToImage":"https://images.livemint.com/img/2020/04/18/600x338/2019-08-15T211328Z_1_LYNXNPEF7E22G_RTROPTP_3_SPACE-EXPLORATION-NASA-MOON_1565985812460_1587198002193.JPG","publishedAt":"2020-04-18T08:27:02Z","content":"Washington: In a bid to find solutions that can address shortage of critical medical equipment like ventilators in tackling the COVID-19 crisis, the US space agency has joined forces with a task force in California to build medical devices to help patients in… [+1827 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"70 Covid-19 vaccines are in development around the world - TRT World","description":"As countries around the world start easing their lockdown restrictions, we're being warned the coronavirus threat will not be over until a vaccine is develop...","url":"https://www.youtube.com/watch?v=59g5jQRoqHo","urlToImage":"https://i.ytimg.com/vi/59g5jQRoqHo/hqdefault.jpg","publishedAt":"2020-04-18T07:16:28Z","content":"As countries around the world start easing their lockdown restrictions, we're being warned the coronavirus threat will not be over until a vaccine is developed. The World Health Organization says it will be at least a year before a vaccine is ready. Sarah Mor… [+352 chars]"},{"source":{"id":"the-hindu","name":"The Hindu"},"author":"PTI","title":"ICMR gets nod for clinical trial of convalescent plasma for COVID-19 treatment - The Hindu","description":"The Drug Controller General of India said ICMR has submitted a list of institutes, which have shown an interest in the trial.","url":"https://www.thehindu.com/sci-tech/health/icmr-gets-nod-for-clinical-trial-of-convalescent-plasma-for-covid-19-treatment/article31372977.ece","urlToImage":"https://www.thehindu.com/news/cities/Hyderabad/oron65/article31283790.ece/ALTERNATES/LANDSCAPE_615/HY07-PLASMA","publishedAt":"2020-04-18T06:45:00Z","content":"The central drug regulator has given its go-ahead to a proposal by the Indian Council of Medical Research (ICMR) for the clinical trial of convalescent plasma in COVID-19 patients, as per the protocol developed by ICMR.\r\nThe Drug Controller General of India s… [+3858 chars]"},{"source":{"id":null,"name":"Ummid.com"},"author":null,"title":"Number of coronavirus infected children far more than expected - ummid.com","description":"Pediatric coronavirus is highly complex, as many hospitals are prohibiting visitors in order to implement social distancing and quarantine protocols","url":"https://ummid.com/news/2020/april/18.04.2020/coronavirus-children-deaths.html","urlToImage":"https://ummid.com/news/2020/april/18.04.2020/corona-in-children.jpg","publishedAt":"2020-04-18T06:42:59Z","content":"[Image for representation.]\r\nNew York: Contrary to what governments and a school of scientists claim (including Tesla and SpaceX CEO Elon Musk), the number of children infected with the coronavirus is far more extensive than what is currently reported -- a hi… [+3391 chars]"},{"source":{"id":null,"name":"Skynews.com.au"},"author":null,"title":"University of Oxford could have coronavirus vaccine ready 'by spring' - Sky News Australia","description":"Euronews reporter Trent Murray says the University of Oxford could have a coronavirus vaccine ready early next year. \n\nThe university expected it could have one million doses of the vaccine ready to distribute by spring in the UK. \n\n“The government’s very opt…","url":"https://www.skynews.com.au/details/_6150404112001","urlToImage":"https://connect-images.viago.io/w_480,c_scale,e_sharpen:80,q_95/74b59ff6ddd457fd349e141c55c7380304593b47164af4086a5751dc467df63a","publishedAt":"2020-04-18T06:29:06Z","content":null},{"source":{"id":null,"name":"News18.com"},"author":"News18","title":"Number of People With Covid-19 Could be 50 to 85 Times Higher Than Official Figures: Stanford Study - News18","description":"To attain herd immunity, 50 per cent or more people in a population would need to have contracted the virus, and be cured of it, the study said.","url":"https://www.news18.com/news/world/number-of-people-with-covid-19-could-be-50-to-85-times-higher-than-official-figures-stanford-study-2582641.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/03/coronavirus-outbreak.jpg","publishedAt":"2020-04-18T05:58:52Z","content":"A study from Stanford University has found that the number of people infected with the novel coronavirus maybe significantly higher than what was originally anticipated.\r\nResearchers analysed samples of 3,300 residents of Californias Santa Clara county and di… [+3123 chars]"},{"source":{"id":null,"name":"Asiatimes.com"},"author":"Issam Ahmed","title":"How Covid-19 may affect the brain - Asia Times","description":"A pattern is emerging among Covid-19 patients arriving at hospitals in New York: Beyond fever, cough and shortness of breath, some are deeply disoriented to the point of not knowing where they are …","url":"http://asiatimes.com/2020/04/how-covid-19-may-affect-the-brain/","urlToImage":"https://i1.wp.com/asiatimes.com/wp-content/uploads/2020/04/000_1PV8IC.jpg?fit=1200%2C724&ssl=1","publishedAt":"2020-04-18T05:56:00Z","content":"A pattern is emerging among Covid-19 patients arriving at hospitals in New York: Beyond fever, cough and shortness of breath, some are deeply disoriented to the point of not knowing where they are or what year it is.\r\nAt times this is linked to low oxygen lev… [+4774 chars]"},{"source":{"id":null,"name":"Thehealthsite.com"},"author":"Jahnavi Sarma","title":"COVID-19: It can lead to kidney and liver damage too - TheHealthSite","description":"We know that COVID-19 can cause lung damage. But now experts say that the new variant of coronavirus can also affect other organs in your body.","url":"https://www.thehealthsite.com/news/covid-19-it-can-lead-to-kidney-and-liver-damage-too-740068/","urlToImage":"https://st1.thehealthsite.com/wp-content/uploads/2020/04/coronavirus-organs-655x353.jpg","publishedAt":"2020-04-18T05:45:00Z","content":"With the COVID-19 pandemic raging unabated across the world, let us revisit the symptoms of this deadly contagion. This virus directly affects the lungs. If you get this infection, you will have inflammation in the small sacs present in your lungs. That is wh… [+2770 chars]"},{"source":{"id":null,"name":"Theprint.in"},"author":"Mohana Basu","title":"June Almeida — the woman who discovered first coronavirus but was told she was wrong - ThePrint","description":"June Almeida, who dropped out of school at 16 because she couldn’t afford it, went on to become a pioneer in virology.","url":"https://theprint.in/science/june-almeida-the-woman-who-discovered-first-coronavirus-but-was-told-she-was-wrong/404182/","urlToImage":"https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/aj.jpg","publishedAt":"2020-04-18T04:49:29Z","content":"New Delhi: When June Almeida, then aged around 34, first claimed to have spotted a new kind of virus in 1964, it was rejected by a peer-reviewed journal, the story goes.\r\nThe images she had captured, of a virus surrounded by what appeared to be a halo or a cr… [+5687 chars]"},{"source":{"id":null,"name":"Daijiworld.com"},"author":null,"title":"Blood test may help doctors catch pancreatic cancer early - Daijiworld.com","description":"","url":"https://www.daijiworld.com/news/newsDisplay.aspx?newsID=698049","urlToImage":"http://www.tvdaijiworld.com/images6/asha_17420_bldtst.jpg","publishedAt":"2020-04-18T04:45:08Z","content":"New York, Apr 18 (IANS): Researchers have revealed that a blood test may be able to help doctors detect the most common form of pancreatic cancer in its early stages. The test could also accurately stage a patient's disease and guide doctors to appropriate tr… [+2016 chars]"},{"source":{"id":null,"name":"Newindianexpress.com"},"author":"PTI","title":"UK sets up new Vaccine Taskforce as COVID-19 death toll hits 14,576 - The New Indian Express","description":"The UK has already pledged 250 million pounds to the international effort to develop a coronavirus vaccine under the Coalition for Epidemic Preparedness Innovations.","url":"https://www.newindianexpress.com/world/2020/apr/18/uk-sets-up-new-vaccine-taskforce-as-covid-19-death-toll-hits-14576-2131828.html","urlToImage":"https://images.newindianexpress.com/uploads/user/imagelibrary/2020/4/6/w600X390/1-PHARM.jpg","publishedAt":"2020-04-18T04:19:00Z","content":"LONDON: The UK has set up a taskforce to urgently find a coronavirus vaccine and prepare the industry to manufacture it at scale once it is developed, as 847 fresh death were reported due to the COVID-19, taking the death toll in the country to 14,576.\r\nAddre… [+3187 chars]"},{"source":{"id":null,"name":"Indiatoday.in"},"author":null,"title":"Coronavirus in India: Covid-19 patient who tested negative dies in Kerala - India Today","description":"An 85-year-old person, who had tested positive for Covid-19 and later tested negative twice, died due to heart attack early Saturday in Kerala. Health Minister KK Shailaja confirmed that the patient did not die of Covid-19 but other ailments.","url":"https://www.indiatoday.in/india/story/coronavirus-india-elderly-covid-19-patient-tested-negative-dies-kerala-1668277-2020-04-18","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/PTI25-03-2020_000136B-min-1guj_6-647x363.jpeg?.CcFM6ip4Ac_Ok4XBwUJ3MZb4UUyGazF","publishedAt":"2020-04-18T04:14:08Z","content":"An 85-year-old Covid-19 patient, who had later tested negative for the novel coronavirus, died due to heart attack early Saturday in Kerala.\r\nSaturday noon, Kerala Health Minister KK Shailaja confirmed that the patient tested negative for the third time as we… [+1966 chars]"},{"source":{"id":null,"name":"News18.com"},"author":"News18","title":"Despite High Number of Civod-19 Cases, Why 'Lucky' Germany Has Lower Death Toll - News18","description":"More than 3,800 people have died in Germany out of more than 133,000 confirmed infections, a rate well below other big European Union countries such as France or Spain.","url":"https://www.news18.com/news/world/despite-high-number-of-civod-19-cases-why-lucky-germany-has-lower-death-toll-2582425.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/03/Untitled-design-88.png","publishedAt":"2020-04-18T04:01:43Z","content":"After making it through the first night breathing on her own, 60-year-old Martina Hamacher can only say: \"I've been lucky.\"\r\nOne of Germany's earliest coronavirus patients, Hamacher is still tangled in some of the tubes and cables that helped keep her alive f… [+4080 chars]"},{"source":{"id":null,"name":"Livemint.com"},"author":"Reuters","title":"UK doctors told to wear aprons as full-length protective gowns run out: Report - Livemint","description":"The new advice says that when gowns run out alternative options include using a plastic apron, borrowing supplies from other hospitals, or wearing coveralls, the Guardian reported.Health minister Matt Hancock told a committee of lawmakers earlier that Britain…","url":"https://www.livemint.com/news/world/covid-19-uk-doctors-told-to-wear-aprons-as-full-length-protective-gowns-run-out-report-11587181388684.html","urlToImage":"https://images.livemint.com/img/2020/04/18/600x338/AFP_1QN9OK_1587181671054_1587181682237.jpg","publishedAt":"2020-04-18T03:50:45Z","content":"LONDON: British healthcare staff have been advised to treat COVID-19 patients without full-length protective gowns due to shortages of equipment, the Guardian newspaper reported on Friday.Health minister Matt Hancock told a committee of lawmakers earlier that… [+971 chars]"},{"source":{"id":null,"name":"Oneindia.com"},"author":"Briti Roy Barman","title":"Watch: What this doctor has to say about those who recovered from COVID-19 - Oneindia","description":"Dr R Narayanababu, Dean of Omandurar Medical College, Chennai said that patients who were tested positive of coronavirus, admitted in hospitals, went to quarantine for 15days, faced mild depression after coming out.","url":"https://www.oneindia.com/india/watch-what-this-doctor-has-to-say-about-those-who-recovered-from-covid-19-3073370.html","urlToImage":"https://www.oneindia.com/img/2020/04/doctor-1587123282.jpg","publishedAt":"2020-04-18T03:49:02Z","content":"Chennai, Apr 17: Dr R Narayanababu, Dean of Omandurar Medical College, Chennai said that patients who were tested positive of coronavirus, admitted in hospitals, went to quarantine for 15days, faced mild depression after coming out.\r\nThe doctor also said that… [+1206 chars]"},{"source":{"id":null,"name":"Theweek.in"},"author":null,"title":"Govt issues guidelines for scaling down COVID-19 containment operations - THE WEEK","description":"The closing of the surveillance for the clusters could be independent of one another","url":"https://www.theweek.in/news/india/2020/04/18/govt-issues-guidelines-for-scaling-down-covid-19-containment-operations.html","urlToImage":"https://www.theweek.in/content/dam/week/news/india/images/2020/4/15/lockdown-howrah-salil.jpg","publishedAt":"2020-04-18T02:56:28Z","content":"Containment operations will be scaled down if no secondary positive case of COVID-19 is reported from a quarantine zone for at least four weeks after the last confirmed test has been isolated and all his contacts have been followed up for 28 days, the Union h… [+3802 chars]"},{"source":{"id":null,"name":"Republicworld.com"},"author":"Brigitte Fernandes","title":"COVID-19 vaccine will be effective in future even if the virus mutates: ICMR - Republic World - Republic World","description":"The ICMR has said that whatever vaccine comes out now for the novel Coronavirus, will work in the future as well even if the virus mutates.","url":"https://www.republicworld.com/technology-news/science/covid-19-vaccine-will-be-effective-even-if-coronavirus-mutates-icmr.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/cm6mzoxzy3qtc9lg_1587175426.jpeg?tr=f-jpeg","publishedAt":"2020-04-18T02:44:25Z","content":"Soon after the researchers at the state government-run Gujarat Biotechnology Research Centre successfully decoded the entire genome sequence of the novel Coronavirus and identified its three new mutations, the Indian Council of Medical Research (ICMR) has sai… [+1929 chars]"},{"source":{"id":null,"name":"News18.com"},"author":"News18.com","title":"Containment Ops to be Scaled Down if No Secondary Coronavirus Case for 4 Weeks: Govt - News18","description":"The closing of the surveillance for the clusters could be independent of one another provided there is no geographic continuity between clusters.","url":"https://www.news18.com/news/india/containment-ops-to-be-scaled-down-if-no-secondary-coronavirus-case-for-4-weeks-govt-2582335.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/04/1587111709_pti13-04-2020_000133b-e1587111927525.jpg","publishedAt":"2020-04-18T02:15:55Z","content":"New Delhi: Containment operations will be scaled down if no secondary positive case of COVID-19 is reported from a quarantine zone for at least four weeks after the last confirmed test has been isolated and all his contacts have been followed up for 28 days, … [+4128 chars]"},{"source":{"id":null,"name":"Indiatoday.in"},"author":null,"title":"Covid-19 vaccine: CSIR to begin trial on anti-leprosy drug - India Today","description":"The Council Of Science and Industrial Research is scheduled to begin its trials on the anti-leprosy vaccine called Mw (Mycobacterium w) to see if it can be used as a Covid-19 vaccine.","url":"https://www.indiatoday.in/india/story/covid-19-vaccine-csir-to-begin-trial-on-anti-leprosy-drug-1668258-2020-04-18","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/PTI17-04-2020_000266B-647x363.jpeg?U8jv9HJVq3U9A4nMUK7v6P1UKwmIalCC","publishedAt":"2020-04-18T02:11:47Z","content":"While the Indian Council of Medical Research (ICMR) announced that it will begin to study the immune-boosting BCG vaccine, Council Of Science and Industrial Research (CSIR) is slated to begin clinical trials on the anti-leprosy vaccine called Mw (Mycobacteriu… [+979 chars]"},{"source":{"id":null,"name":"Biospectrumasia.com"},"author":null,"title":"Three Chinese vaccines against COVID-19 are on the way - BSA bureau","description":"Two COVID-19 inactivated vaccines were just approved for a phase I & II combined clinical trial by the NMPA of China","url":"https://www.biospectrumasia.com/news/48/15799/three-chinese-vaccines-against-covid-19-are-on-the-way.html","urlToImage":"https://www.biospectrumasia.com/uploads/articles/bioworld_medtecdh-15799.png","publishedAt":"2020-04-18T01:11:45Z","content":"According to the latest news from Science and Technology Daily, two COVID-19 inactivated vaccines were just approved for a phase I &amp; II combined clinical trial by the National Medical Products Administration (NMPA) of China, making them the first batch in… [+2851 chars]"}]}