{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Study: Paper towel better at removing viruses - Click On Detroit | Local 4 | WDIV","description":"You might want to consider paper towel when drying your hands.","url":"https://www.youtube.com/watch?v=pLCqClF-FSY","urlToImage":"https://i.ytimg.com/vi/pLCqClF-FSY/maxresdefault.jpg","publishedAt":"2020-04-17T10:30:52Z","content":null},{"source":{"id":null,"name":"Mirror.co.uk"},"author":"Chris Kitching","title":"People infected with coronavirus can spread it simply by talking, study finds - Mirror Online","description":"Coronavirus carriers emit tiny liquid droplets that could linger in the air - and be inhaled by others - for up to three hours, highlighting the need for masks, new studies have found","url":"https://www.mirror.co.uk/news/us-news/people-infected-coronavirus-can-spread-21881754","urlToImage":"https://i2-prod.mirror.co.uk/incoming/article21882448.ece/ALTERNATES/s1200/0_ITALY-HEALTH-VIRUS.jpg","publishedAt":"2020-04-17T10:29:38Z","content":"A person with coronavirus could infect others around them simply by saying one or two words in a calm and normal voice, a new study suggests. \r\nWhen a Covid-19 carrier speaks, they emit tiny liquid droplets that contain infectious virus particles and could li… [+2871 chars]"},{"source":{"id":null,"name":"Thehindubusinessline.com"},"author":"M Ramesh","title":"IISc, start-up developing vaccine for Covid-19 - BusinessLine","description":"Chennai, April 17 The Indian Institute of Science (IISc) has jumped into the fray to develop a vaccine for coronavirus (Covid-19). A team headed by Dr Raghavan Varadarajan of the Molecular Biophysics","url":"https://www.thehindubusinessline.com/news/science/iisc-start-up-developing-vaccine-for-covid-19/article31365134.ece","urlToImage":"https://www.thehindubusinessline.com/static/theme/default/base/img/og-image.jpg","publishedAt":"2020-04-17T09:47:59Z","content":"Chennai, April 17\r\n The Indian Institute of Science (IISc) has jumped into the fray to develop a vaccine for coronavirus (Covid-19). A team headed by Dr Raghavan Varadarajan of the Molecular Biophysics Unit of IISc is looking at a bunch of vaccine candidates … [+2036 chars]"},{"source":{"id":null,"name":"Telanganatoday.com"},"author":"Telangana Today","title":"Dance with your grandma tonight to improve her life quality - Telangana Today","description":"Jerusalem: Physical fitness and social connection can be difficult to maintain in old age but researchers have found that Dance Movement Therapy (DMT) may promote exercise, improve quality of life and deepen familial ties between grandparents and grandchildre…","url":"https://telanganatoday.com/dance-with-your-grandma-tonight-to-improve-her-life-quality","urlToImage":"https://cdn.telanganatoday.com/wp-content/uploads/2020/04/dance.jpg","publishedAt":"2020-04-17T09:41:00Z","content":"Jerusalem: Physical fitness and social connection can be difficult to maintain in old age but researchers have found that Dance Movement Therapy (DMT) may promote exercise, improve quality of life and deepen familial ties between grandparents and grandchildre… [+2294 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Countries turn to plasma therapy to treat coronavirus - TRT World","description":"As doctors and scientists around the world are struggling to cope with this crisis, there’s one treatment that’s starting to slowly prove effective for criti...","url":"https://www.youtube.com/watch?v=wiv0jswIaog","urlToImage":"https://i.ytimg.com/vi/wiv0jswIaog/hqdefault.jpg","publishedAt":"2020-04-17T08:51:50Z","content":"As doctors and scientists around the world are struggling to cope with this crisis, theres one treatment thats starting to slowly prove effective for critical sufferers. Its not a recent innovation either. Lessons are now being learned from medical history, a… [+299 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Pune Mirror","title":"50-year-old COVID-19 positive man dies in Pune, 288 fresh cases in state - Pune Mirror","description":"A 50-year-old suffering from coronavirus succumbed to the infection in Pune on Friday, taking the death toll in the district to 48.","url":"https://punemirror.indiatimes.com/pune/others/50-year-old-covid-19-positive-man-dies-in-pune-288-fresh-cases-in-state/articleshow/75196473.cms","urlToImage":"https://static.toiimg.com/photo/imgsize-139044,msid-75197123/75197123.jpg","publishedAt":"2020-04-17T08:45:39Z","content":"A 50-year-old suffering from coronavirus succumbed to the infection in Pune\r\n on Friday, taking the death toll in the district to 48.\r\nOfficials said the patient was admitted to the government-run Sassoon Hospital\r\n and suffered from pre-existing illnesses. H… [+1204 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Times Of India","title":"Covid-19: MP with 361 new cases sets single-day record, 244 in Indore alone - Times of India","description":"India News: Madhya Pradesh along with Gujarat, which recorded 163 fresh cases, were clearly emerging as the new coronavirus crisis states. The total number of Cov","url":"https://timesofindia.indiatimes.com/india/corona-cases-in-india-mp-with-361-new-cases-sets-single-day-record-244-in-indore-alone/articleshow/75190804.cms","urlToImage":"https://static.toiimg.com/thumb/msid-75190859,width-1070,height-580,imgsize-120740,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2020-04-17T07:27:07Z","content":"Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"},{"source":{"id":null,"name":"Telanganatoday.com"},"author":"Telangana Today","title":"Genetics linked to childhood emotional, psychiatric problems - Telangana Today","description":"Sydney: Emotional, social and psychiatric problems in children and adolescents have been linked to higher levels of genetic vulnerability for adult depression, researchers have found. For the findings, published in the JAMA Psychiatry, the research team analy…","url":"https://telanganatoday.com/genetics-linked-to-childhood-emotional-psychiatric-problems","urlToImage":"https://cdn.telanganatoday.com/wp-content/uploads/2020/04/genetic.jpg","publishedAt":"2020-04-17T07:18:00Z","content":"Sydney: Emotional, social and psychiatric problems in children and adolescents have been linked to higher levels of genetic vulnerability for adult depression, researchers have found.\r\nFor the findings, published in the JAMA Psychiatry, the research team anal… [+1782 chars]"},{"source":{"id":null,"name":"Republicworld.com"},"author":"Chitra Jain","title":"What is World Haemophilia Day? Learn about its significance and theme for this year here - Republic World - Republic World","description":"World Haemophilia Day is celebrated to increase awareness about haemophilia & other blood disorders. Learn about World Haemophilia Day & its significance.","url":"https://www.republicworld.com/lifestyle/health/what-is-world-haemophilia-day.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/zzb0cj3ujdi8ndkc_1587100501.jpeg?tr=f-jpeg","publishedAt":"2020-04-17T06:40:00Z","content":"World Haemophilia Day is widely recognized around the world with an effort to increase awareness among the people about Haemophilia and other inherited blood disorders. Haemophilia is a hereditary blood disorder in which the ability of blood to clot is affect… [+3195 chars]"},{"source":{"id":null,"name":"Livemint.com"},"author":"PTI","title":"New smartphone app may warn about Covid-19 exposure while protecting privacy - Livemint","description":"The app being developed by researchers uses Bluetooth-enabled cell phones to notify a person if they have come into close proximity with someone infected with SARS-CoV-2.To work efficiently, the app requires many people to use it, whether they have had COVID-…","url":"https://www.livemint.com/news/india/new-smartphone-app-may-warn-about-covid-19-exposure-while-protecting-privacy-11587104405205.html","urlToImage":"https://images.livemint.com/img/2020/04/17/600x338/app-k7pD--621x414@LiveMint_1587104709180.jpg","publishedAt":"2020-04-17T06:27:42Z","content":"Boston: Scientists, including one of Indian origin, are working on a smartphone app that could let people know if they have come in contact with someone who has tested positive for COVID-19, while protecting their privacy.The app being developed by researcher… [+2248 chars]"},{"source":{"id":null,"name":"Mongabay.com"},"author":"sahana","title":"Livestock handling not linked to SARS-CoV-2, says expert - Mongabay-India","description":"There is no evidence that potentially zoonotic disease COVID-19 can be transmitted from livestock to humans. This is specially relevant to northeast India.","url":"https://india.mongabay.com/2020/04/interview-rumours-linking-livestock-to-covid-19-unfounded-says-expert/","urlToImage":"https://imgs.mongabay.com/wp-content/uploads/sites/30/2020/04/17112749/livestock2.jpg","publishedAt":"2020-04-17T06:00:41Z","content":"<ul><li>Surveillance of zoonotic diseases is crucial in northeast India because of the close association of people and animals in the region that is mainly influenced by the smaller herd size of livestock, socio-cultural beliefs, smaller landholdings, and hil… [+16496 chars]"},{"source":{"id":null,"name":"Theprint.in"},"author":"Faye Flam","title":"Doctors are learning more about treatment as coronavirus cases rise - ThePrint","description":"Doctors are learning more about just how weird this disease can be when people get sick enough to be hospitalised. And the learning curve is steep.","url":"https://theprint.in/opinion/doctors-are-learning-more-about-treatment-as-coronavirus-cases-rise/403523/","urlToImage":"https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/covid-testing-scaled-e1586165716865.jpg","publishedAt":"2020-04-17T05:33:30Z","content":"So much of the news around Covid-19 is scary, but there is a hopeful item to share: A steep rise in the learning curve of doctors treating critically ill coronavirus patients.\r\nDoctors are learning more about just how weird this disease can be when people get… [+5952 chars]"},{"source":{"id":null,"name":"India.com"},"author":"India.com News Desk","title":"Can Dogs Really Sniff Out Asymptomatic Coronavirus Patients? - India.com","description":"It's true, scientists in London may have just found a way to revolutionise the detection of COVID-19 cases with the help of our furry buddies.","url":"https://www.india.com/news/world/can-dogs-really-sniff-out-asymptomatic-coronavirus-patients-4002481/","urlToImage":"https://www.india.com/wp-content/uploads/2019/07/dogs-2.jpg","publishedAt":"2020-04-17T04:59:06Z","content":"New Delhi: So far we knew detection dogs could sniff out bombs, drugs and any other suspicious activities, however, a new study found out that dogs may also be able to solve the biggest hurdle around the globe currently – symptoms of the deadly coronavirus in… [+1526 chars]"},{"source":{"id":null,"name":"News18.com"},"author":"Trending Desk","title":"How to Wash Your Clothes Properly to Ensure They're Coronavirus-Free - News18","description":"Along with following the instructions to maintain hygiene, social distancing and washing hands-on regular intervals, one should also take care of the clothes they wear and how they should be sanitized properly.","url":"https://www.news18.com/news/india/how-to-wash-your-clothes-properly-to-ensure-theyre-coronavirus-free-2580959.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/04/1587094519_untitled-design-3.png","publishedAt":"2020-04-17T03:54:20Z","content":"The deadly strain of novel coronavirus or SARS-CoV-2 was declared a pandemic when the World Health Organisation realized its impact on the lives of people. \r\nAlong with following the instructions to maintain hygiene, social distancing and washing hands-on reg… [+1492 chars]"},{"source":{"id":null,"name":"Aninews.in"},"author":null,"title":"Blood test may help doctors detect pancreatic cancer, says study - ANI News","description":"Washington DC [USA], April 17 (ANI): In a multidisciplinary study, researchers have found that a blood test may be able to detect the most common form of pancreatic cancer when it is still in its early stages, while also helping doctors accurately stage a pat…","url":"https://www.aninews.in/news/health/blood-test-may-help-doctors-detect-pancreatic-cancer-says-study20200417085838","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/__sized__/TBI_Blood_Test_IrjeEPf-thumbnail-154x87-70.jpg","publishedAt":"2020-04-17T03:28:00Z","content":"ANI | Updated: Apr 17, 2020 08:58 IST\r\nWashington DC [USA], April 17 (ANI): In a multidisciplinary study, researchers have found that a blood test may be able to detect the most common form of pancreatic cancer when it is still in its early stages, while also… [+3114 chars]"},{"source":{"id":null,"name":"Orissapost.com"},"author":"Post News Network","title":"COVID-19 may have profound impact on mental health: Experts - OrissaPOST","description":"Experts have warned that the COVID-19 pandemic is likely to have a ‘profound and pervasive impact’ on global mental health as billions struggle to cope with isolated living and anxiety spikes. A team of 24 experts, through a paper published in Lancet Psychiat…","url":"https://www.orissapost.com/covid-19-may-have-profound-impact-on-mental-health-experts/","urlToImage":"https://www.orissapost.com/wp-content/uploads/2020/04/Representational-image.jpg","publishedAt":"2020-04-17T03:14:34Z","content":"Experts have warned that the COVID-19 pandemic is likely to have a profound and pervasive impact on global mental health as billions struggle to cope with isolated living and anxiety spikes.\r\nA team of 24 experts, through a paper published in Lancet Psychiatr… [+2749 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"ANI","title":"Exercising may help improve mental fitness, says research - Yahoo India News","description":"Washington DC [USA], April 17 (ANI): Indulging in sports activities and exercising has been proved to improve your cognitive performance, but which type and how much exercise will keep your mind in top shape?  The large scale analysis was carried out at the U…","url":"https://in.news.yahoo.com/exercising-may-help-improve-mental-fitness-says-research-023716112.html","urlToImage":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png","publishedAt":"2020-04-17T02:53:35Z","content":"Washington DC [USA], April 17 (ANI): Indulging in sports activities and exercising has been proved to improve your cognitive performance, but which type and how much exercise will keep your mind in top shape?\r\nThis is the question that has been explored by re… [+2950 chars]"},{"source":{"id":null,"name":"Zeebiz.com"},"author":"Prashant Singh","title":"Coronavirus days numbered? Check latest update on Covid-19 vaccine - Zee Business","description":"With deadly coronavirus showing no sign of slowing down in taking human lives, there is a positive development on the covid 19 pandemic.","url":"https://www.zeebiz.com/india/news-coronavirus-days-numbered-check-latest-update-on-covid-19-vaccine-124250","urlToImage":"https://cdn.zeebiz.com/sites/default/files/2020/04/16/116539-covid.jpg","publishedAt":"2020-04-17T02:39:02Z","content":"With deadly coronavirus showing no sign of slowing down in taking human lives, there is a positive development on the covid 19 pandemic. According to a latest development, six Indian companies are working on a vaccine for COVID-19, joining global efforts to f… [+2536 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"Abantika Ghosh","title":"Study from China: 44% got Covid from people without symptoms - The Indian Express","description":"The study, published in Nature Medicine on April 15, looked at 94 patients with laboratory-confirmed COVID-19 admitted to Guangzhou Eighth People’s Hospital.","url":"https://indianexpress.com/article/coronavirus/covid-19-research-study-china-symptoms-transmission-6366156/","urlToImage":"https://images.indianexpress.com/2020/04/Coronavirus-759-9.jpg?w=759","publishedAt":"2020-04-17T02:07:18Z","content":"Written by Abantika Ghosh\r\n | New Delhi | \r\nUpdated: April 17, 2020 7:32:44 am\r\nThey estimated that viral shedding which is when a person infects another starts happening two to three days before the onset of symptoms. (Source: Max Planck Institute)Even as In… [+4035 chars]"},{"source":{"id":null,"name":"Hindustantimes.com"},"author":"Sanchita Sharma","title":"Patients start infection spread before symptoms set in: Study - Hindustan Times","description":"Infectiousness declined significantly eight days after symptoms appear, but 44% people got infected by people with no visible signs of illness, according to a study from Hong Kong published in Nature Medicine on April 15.","url":"https://www.hindustantimes.com/india-news/patients-start-infection-spread-before-symptoms-set-in-study/story-zocsrH61PeyVLT8vxPYEwN.html","urlToImage":"https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/17/Pictures/delhi-lockdown-covid-19-day-23_7ffeab8c-8037-11ea-bf35-36f2d834daf8.jpg","publishedAt":"2020-04-17T01:55:46Z","content":"People with the coronavirus disease (Covid-19) start infecting others two to three days before they develop symptoms of fever and cough, according to a study from China which suggests effective outbreak containment must include contact tracing of people who h… [+4248 chars]"}]}